Autodesk.Revit.ApplicationServices.Application.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,Autodesk.Revit.DB.IOpenFromCloudCallback)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
openFromCloudCallback:
The interface implementation to use when opening a cloud document. Only used for opening cloud model.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2019

Autodesk.Revit.ApplicationServices.Application.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
-or-
File was saved by an application that was not developed or licensed by Autodesk.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2013